while True:  #создаем цикл
    n = []  #создаем список
    a = int(input('Введите число от 3 до 20:' ))
    if a > 2 and a < 21:  #условие что больше двух но меньше 21
        for j in range(1, a):   #первый вложенный цикл
            for k in range(1, a):   #второй вложенный уикл
                if a % (j+k)==0 and j < k:  #условие на равенство циклов или одно больше другого
                    n.append(j)  #append(J) добавляем в конец списка элемент
                    n.append(k)   #append(k) добавляем в конец списка элемент
    print("result", n)
